#### Terraform Prod Format and Style 🖌 `success`
#### Terraform Prod Initialization ⚙️ `success`
#### Terraform Prod Validation 🤖 `success`
<details><summary>Prod Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Prod Plan 📖 `success`

<details><summary>Show Prod Plan</summary>

```

terraform
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 0s [id=1595119053308507]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be created
  + resource "databricks_job" "batch_inference_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-mlops-poc-batch-inference-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/pleelapr/mlops-poc"
        }

      + new_cluster {
          + custom_tags                  = {
              + "clusterSource" = "mlops-stack/0.0"
            }
          + data_security_mode           = "SINGLE_USER"
          + driver_instance_pool_id      = (known after apply)
          + driver_node_type_id          = (known after apply)
          + enable_elastic_disk          = (known after apply)
          + enable_local_disk_encryption = (known after apply)
          + node_type_id                 = "Standard_D3_v2"
          + num_workers                  = 3
          + single_user_name             = "192fa7e6-8b40-4994-ba2d-d7cba0f913a7"
          + spark_version                = "11.0.x-cpu-ml-scala2.12"
        }

      + notebook_task {
          + base_parameters = {
              + "env"               = "prod"
              + "input_table_name"  = "mlopspoc_inputs"
              + "output_table_name" = "mlopspoc_predictions"
            }
          + notebook_path   = "mlops-poc/deployment/batch_inference/notebooks/BatchInference"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 11 * * ?"
          + timezone_id            = "UTC"
        }
    }

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-mlops-poc-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/pleelapr/mlops-poc"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + single_user_name             = "192fa7e6-8b40-4994-ba2d-d7cba0f913a7"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env"                = "prod"
                  + "experiment_name"    = "/mlops-poc-prod/prod-mlops-poc-experiment"
                  + "model_name"         = "prod-mlops-poc-model"
                  + "training_data_path" = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                }
              + notebook_path   = "mlops-poc/training/notebooks/TrainWithFeatureStore"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "ModelValidation"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "custom_metrics_loader_function"        = "squared_diff_plus_one"
                  + "enable_baseline_comparison"            = "true"
                  + "experiment_name"                       = "/mlops-poc-prod/prod-mlops-poc-experiment"
                  + "model_type"                            = "regressor"
                  + "run_mode"                              = "disabled"
                  + "targets"                               = "mean_squared_error"
                  + "validation_input"                      = "SELECT * FROM delta.`dbfs:/databricks-datasets/nyctaxi-with-zipcodes/subsampled`"
                  + "validation_thresholds_loader_function" = "mean_squared_error"
                }
              + notebook_path   = "mlops-poc/validation/notebooks/ModelValidation"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "ModelValidation"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "prod"
                }
              + notebook_path   = "mlops-poc/deployment/model_deployment/notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_job.write_feature_table_job will be created
  + resource "databricks_job" "write_feature_table_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "prod-mlops-poc-write-feature-table-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "release"
          + provider = "gitHub"
          + url      = "https://github.com/pleelapr/mlops-poc"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "PickupFeatures"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "features_transform_module" = "pickup_features"
                  + "input_end_date"            = ""
                  + "input_start_date"          = ""
                  + "input_table_path"          = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                  + "output_table_name"         = "feature_store_taxi_example.trip_pickup_features"
                  + "primary_keys"              = "zip"
                  + "timestamp_column"          = "tpep_pickup_datetime"
                }
              + notebook_path   = "mlops-poc/feature_engineering/notebooks/GenerateAndWriteFeatures"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "DropoffFeatures"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "features_transform_module" = "dropoff_features"
                  + "input_end_date"            = ""
                  + "input_start_date"          = ""
                  + "input_table_path"          = "/databricks-datasets/nyctaxi-with-zipcodes/subsampled"
                  + "output_table_name"         = "feature_store_taxi_example.trip_dropoff_features"
                  + "primary_keys"              = "zip"
                  + "timestamp_column"          = "tpep_dropoff_datetime"
                }
              + notebook_path   = "mlops-poc/feature_engineering/notebooks/GenerateAndWriteFeatures"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for mlops-poc project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/mlops-poc-prod/prod-mlops-poc-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "prod-mlops-poc-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.batch_job_permissions will be created
  + resource "databricks_permissions" "batch_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.feature_job_permissions will be created
  + resource "databricks_permissions" "feature_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mlops-poc_batch_inference_job_id = (known after apply)
  + mlops-poc_experiment_id          = (known after apply)
  + mlops-poc_experiment_name        = "/mlops-poc-prod/prod-mlops-poc-experiment"
  + mlops-poc_model_name             = "prod-mlops-poc-model"
  + mlops-poc_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>